jpnorair/OpenTag/include/board/stm32l0xx/nucleo_LRWAN1.h
/* Copyright 2013-2014 JP Norair
  *
  * Licensed under the OpenTag License, Version 1.0 (the "License");
  * you may not use this file except in compliance with the License.
  * You may obtain a copy of the License at
  *
  * http://www.indigresso.com/wiki/doku.php?id=opentag:license_1_0
  *
  * Unless required by applicable law or agreed to in writing, software
  * distributed under the License is distributed on an "AS IS" BASIS,
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  */
/**
  * @file       /board/stm32l0xx/nucleo_LRWAN1.h
  * @author     JP Norair
  * @version    R100
  * @date       29 Oct 2016
  * @brief      Board Configuration for Nucleo STM32L073 with LoRa module
  * @ingroup    Platform
  *
  * Do not include this file, include /platform/config.h
  *
  * SPECIAL NOTE: search for "note BOARD Macro" lines in this file.  These
  * must be ported to other STM32L boards, because the OpenTag STM32L platform 
  * implementation depends on them.
  *
  ******************************************************************************
  */
  

#ifndef __nucleo_LRWAN1_H
#define __nucleo_LRWAN1_H

/// MCU definition for the board must be the first thing
#define __STM32L073RZ__

/// This is a major difference between the LRWAN1 system and the unladen Nucleo
#define __USE_RADIO

#include <app/app_config.h>
#include <platform/hw/STM32L0xx_config.h>
#include <platform/interrupts.h>


#ifdef __USE_RADIO
#   ifdef __NULL_RADIO__
#       include <io/null_radio/config.h>
#   else
#       include <io/sx127x/config.h>
#   endif
#endif



/// Macro settings: ENABLED, DISABLED, NOT_AVAILABLE
#ifdef ENABLED
#   undef ENABLED
#endif
#define ENABLED  1

#ifdef DISABLED
#   undef DISABLED
#endif
#define DISABLED  0

#ifdef NOT_AVAILABLE
#   undef NOT_AVAILABLE
#endif
#define NOT_AVAILABLE   DISABLED




/** Additional RF Front End Parameters and Settings <BR>
  * ========================================================================<BR>
  * We assume you are using the included antenna and matching circuit, which 
  * has a 50% efficiency (-3dB) with 1dB insertion loss
  */
#ifdef __USE_RADIO
#   define RF_PARAM_BAND   866              //Can be 866 or 915
#   define RF_HDB_ATTEN    8                //Half dB attenuation (units = 0.5dB), used to scale TX power
#   define RF_HDB_RXATTEN  6
#   define RF_RSSI_OFFSET  RF_HDB_RXATTEN   //Offset applied to RSSI calculation
#endif



/** MCU Configuration settings      <BR>
  * ========================================================================<BR>
  * Implemented capabilities of the STM32L variants on this board/build
  *
  * On this board, the Jupiter DK, you can use USB or UART for MPipe
  */
#define MCU_CONFIG(VAL)                 MCU_CONFIG_##VAL   // FEATURE 
#define MCU_CONFIG_MULTISPEED           DISABLED                            // Allows usage of MF-HF clock boosting
#define MCU_CONFIG_MAPEEPROM            DISABLED
#define MCU_CONFIG_MPIPECDC             ENABLED                             // USB-CDC MPipe implementation
#define MCU_CONFIG_MPIPEUART            (MCU_CONFIG_MPIPECDC != ENABLED)    // UART MPipe Implementation
#define MCU_CONFIG_MPIPEI2C             DISABLED                            // I2C MPipe Implementation
#define MCU_CONFIG_MEMCPYDMA            ENABLED                             // MEMCPY DMA should be lower priority than MPIPE DMA
#define MCU_CONFIG_USB                  (MCU_CONFIG_MPIPECDC == ENABLED)
#define MCU_CONFIG_VOLTLEVEL            2  // 3=1.2, 2=1.5V, 1=1.8V





/** Platform Memory Configuration <BR>
  * ========================================================================<BR>
  * OpenTag needs to know where it can put Nonvolatile memory (file system) and
  * how much space it can allocate for filesystem.  For this configuration, 
  * Veelite is put into EEPROM.
  *
  * The STM32L0 uses 128 byte Flash pages and 2KB Flash sectors.  Therefore, it
  * is best to allocate the FS in Flash on 2KB boundaries because this is the 
  * resolution that can be write protected (or, as with FS, *NOT* write 
  * protected).  Best practice with STM32 chips is to put the FS at the back of
  * of the Flash space because this seems to work best with the debugger HW.
  */

// You can comment-out these if you want to use chip defaults
#ifndef SRAM_SIZE
#   define SRAM_SIZE            (20*1024)
#endif
#ifndef EEPROM_SIZE
#   define EEPROM_SIZE          (6*1024)
#endif
#ifndef FLASH_SIZE
#   define FLASH_SIZE           (64*1024)
#endif
#ifndef EEPROM_SAVE_SIZE
#   define EEPROM_SAVE_SIZE     (0)
#endif

// EEPROM LOCAL DATA
#define EEPROM_LOCAL_ADDR       (EEPROM_START_ADDR + EEPROM_SIZE - EEPROM_SAVE_SIZE)
#define EEPROM_LOCAL_U8         (ot_u8*)EEPROM_LOCAL_ADDR
#define EEPROM_LOCAL_U16        (ot_u16*)EEPROM_LOCAL_ADDR
#define EEPROM_LOCAL_U32        (ot_u32*)EEPROM_LOCAL_ADDR

// Using EEPROM: Pages figure is irrelevant
#define FLASH_NUM_PAGES         (FLASH_SIZE/FLASH_PAGE_SIZE)
#define FLASH_FS_ADDR           (EEPROM_START_ADDR)
#define FLASH_FS_PAGES          0
#define FLASH_FS_FALLOWS        0 
#define FLASH_FS_ALLOC          (EEPROM_SIZE - EEPROM_SAVE_SIZE) 








/** Board-based Feature Settings <BR>
  * ========================================================================<BR>
  * 1. One button is supported on PC13.  The button must be attached by the 
  *    user.  It is active low.  Other buttons could be added on the unused
  *    pins, but only one is pre-defined.
  * 
  * 2. Two LEDs are defined on PC2, PC3, but the user must attach LEDs.
  *    <LI> TRIG1 (typically Orange LED) is on PC2.  It typically indicates 
  *         that the radio is on and in RX mode.</LI>
  *    <LI> TRIG2 (typically Green LED) is on PC3.  It typically indicates
  *         that the radio is on and in TX mode.</LI>
  *
  * 3. MPIPE can support UART TX/RX (no flow control) or I2C.  MPIPE supports
  *    a "break" mode, in both I2C and UART interfaces, where a break character 
  *    is transmitted by the client ahead of the packet in order to wakeup the 
  *    system.  This reduces power requirements.  Unfortunately, short-sighted
  *    design of the LoRa expansion board prevents the Break feature from 
  *    working on this board.
  *
  * 4. The Debug and Upload interface is SWD.  There is no serial bootloader
  *    capability at the time of writing.  
  *    (Editorial Note: A ST-Link-V2 has SWD and a low price of US$25.  
  *    It can work with OpenOCD, so the toolchain is still very cheap.)
  * 
  * 5. The SX127x SPI benefits from the highest speed clock up to 20 MHz.
  */
#define BOARD_FEATURE(VAL)              BOARD_FEATURE_##VAL
#define BOARD_PARAM(VAL)                BOARD_PARAM_##VAL

#define BOARD_FEATURE_MPIPE             ENABLED
#define BOARD_FEATURE_USBCONVERTER      BOARD_FEATURE_MPIPE         // Is UART connected via USB converter?
#define BOARD_FEATURE_MPIPE_BREAK       DISABLED                    // Send/receive leading break for wakeup

// MPIPE UART modes are deprecated.  Only Break-mode should be used.
//#define BOARD_FEATURE_MPIPE_DIRECT      DISABLED                     // BOARD_FEATURE_MPIPE
//#define BOARD_FEATURE_MPIPE_CS          DISABLED                    // Chip-Select / DTR wakeup control
//#define BOARD_FEATURE_MPIPE_FLOWCTL     DISABLED                    // RTS/CTS style flow control 

#define BOARD_FEATURE_LFXTAL            ENABLED                                 // LF XTAL used as Clock source
#define BOARD_FEATURE_HFXTAL            DISABLED                                // HF XTAL used as Clock source
#define BOARD_FEATURE_HFBYPASS          DISABLED                                // Use an externally driven oscillator
#define BOARD_FEATURE_HFCRS             (BOARD_FEATURE_HFXTAL != ENABLED)       // Use STM32L0's Clock-Recovery-System for USB
#define BOARD_FEATURE_RFXTAL            DISABLED                                // XTAL for RF chipset
#define BOARD_FEATURE_RFXTALOUT         DISABLED
#define BOARD_FEATURE_PLL               (MCU_CONFIG_MULTISPEED == ENABLED)
#define BOARD_FEATURE_STDSPEED          (MCU_CONFIG_MULTISPEED == ENABLED)
#define BOARD_FEATURE_FULLSPEED         ENABLED
#define BOARD_FEATURE_FULLXTAL          DISABLED
#define BOARD_FEATURE_FLANKSPEED        (MCU_CONFIG_MULTISPEED == ENABLED)
#define BOARD_FEATURE_FLANKXTAL         (BOARD_FEATURE_HFCRS != ENABLED)
#if (MCU_CONFIG(USB) && BOARD_FEATURE(PLL) && (BOARD_FEATURE(HFXTAL) || BOARD_FEATURE(HFBYPASS)))
#   warning "Nucleo board does not normally support XTAL-based USB.  Make sure you have a crystal mounted."
#   define BOARD_FEATURE_USBPLL         ENABLED
#elif MCU_CONFIG(USB)
#   undef BOARD_FEATURE_HFCRS
#   define BOARD_FEATURE_HFCRS          ENABLED
#   define BOARD_FEATURE_USBPLL         DISABLED
#else
#   define BOARD_FEATURE_USBPLL         DISABLED
#endif

#define BOARD_PARAM_TRIGS               2
#define BOARD_PARAM_LFHz                32768
#define BOARD_PARAM_LFtol               0.00002
#define BOARD_PARAM_MFHz                4200000
#define BOARD_PARAM_MFmult              1                       // Main CLK = HFHz * (MFmult/MFdiv)
#define BOARD_PARAM_MFdiv               1
#define BOARD_PARAM_MFtol               0.02
#define BOARD_PARAM_HFHz                16000000
#define BOARD_PARAM_HFtol               0.02
#define BOARD_PARAM_HFppm               20000
//#define BOARD_PARAM_RFHz                48000000
//#define BOARD_PARAM_RFdiv               6
//#define BOARD_PARAM_RFout               (BOARD_PARAM_RFHz/BOARD_PARAM_RFdiv)
//#define BOARD_PARAM_RFtol               0.00003
#define BOARD_PARAM_PLLout              96000000
#define BOARD_PARAM_PLLmult             (BOARD_PARAM_PLLout/BOARD_PARAM_HFHz)
#define BOARD_PARAM_PLLdiv              3
#define BOARD_PARAM_PLLHz               (BOARD_PARAM_PLLout/BOARD_PARAM_PLLdiv)

