jpnorair/OpenTag/include/board/stm32l0xx/nucleo_LRWAN1.h
    GPIOB->MODER    = (GPIO_MODER_ANALOG << (0*2)) \
                    | (GPIO_MODER_ANALOG << (1*2)) \
                    | (GPIO_MODER_ANALOG << (2*2)) \
                    | (GPIO_MODER_IN     << (3*2)) \
                    | (GPIO_MODER_ANALOG << (4*2)) \
                    | (GPIO_MODER_IN     << (5*2)) \
                    | (GPIO_MODER_OUT    << (6*2)) \
                    | (GPIO_MODER_ANALOG << (7*2)) \
                    | (GPIO_MODER_OUT    << (8*2)) \
                    | (GPIO_MODER_OUT    << (9*2)) \
                    | (GPIO_MODER_ANALOG << (10*2)) \
                    | (GPIO_MODER_ANALOG << (11*2)) \
                    | (GPIO_MODER_ANALOG << (12*2)) \
                    | (GPIO_MODER_ANALOG << (13*2)) \
                    | (GPIO_MODER_ANALOG << (14*2)) \
                    | (GPIO_MODER_ANALOG << (15*2));
    
    GPIOB->OSPEEDR  = (GPIO_OSPEEDR_10MHz << (8*2)) \
                    | (GPIO_OSPEEDR_10MHz << (9*2));
    
    /// Configure Port C IO.
    /// Port C is used only for USB sense and 32kHz crystal driving
    // - C0:1 are analog inputs
    // - C2:6 are unused and set to analog
    // - C7 is the radio shutdown push-pull output
    // - C8:12 are unused and set to analog
    // - C13 is the user button, set to input HiZ
    // - C14:15 are 32kHz crystal driving, set to ALT
#   ifdef __USE_RADIO
    GPIOC->BSRR     = BOARD_RFCTL_SDNPIN;
#   endif

    GPIOC->MODER    = (GPIO_MODER_ANALOG << (0*2)) \
                    | (GPIO_MODER_ANALOG << (1*2)) \
                    | (GPIO_MODER_ANALOG << (2*2)) \
                    | (GPIO_MODER_ANALOG << (3*2)) \
                    | (GPIO_MODER_ANALOG << (4*2)) \
                    | (GPIO_MODER_ANALOG << (5*2)) \
                    | (GPIO_MODER_ANALOG << (6*2)) \
                    | (GPIO_MODER_OUT    << (7*2)) \
                    | (GPIO_MODER_ANALOG << (8*2)) \
                    | (GPIO_MODER_ANALOG << (9*2)) \
                    | (GPIO_MODER_ANALOG << (10*2)) \
                    | (GPIO_MODER_ANALOG << (11*2)) \
                    | (GPIO_MODER_ANALOG << (12*2)) \
                    | (GPIO_MODER_IN     << (13*2)) \
                    | (GPIO_MODER_OUT    << (14*2)) \
                    | (GPIO_MODER_ALT    << (15*2));
    
    /// Configure Port D I/O
    /// Port D is completely unused and set by default to Analog
    GPIOD->MODER    = 0xFFFFFFFF;
    
    // Assert Port H as HiZ
    GPIOH->MODER    = (GPIO_MODER_IN << (0*2))
                    | (GPIO_MODER_IN << (1*2));
    
    /// Configure Port H for Crystal Bypass
    /// By default it is set to HiZ input.  It is changed on-demand in FW
    
    // Disable GPIOC and GPIOH, they are never altered after this.
    RCC->IOPENR = _IOPENR_RUNTIME;
}





static inline void BOARD_RFSPI_CLKON(void) {
#ifdef __USE_RADIO
    BOARD_RFSPI_PORT->MODER &= ~((3 << (BOARD_RFSPI_SCLKPINNUM*2)) \
                            | (3 << (BOARD_RFSPI_MISOPINNUM*2)) \
                            | (3 << (BOARD_RFSPI_MOSIPINNUM*2)) );
    
    BOARD_RFSPI_PORT->MODER |= (GPIO_MODER_ALT << (BOARD_RFSPI_SCLKPINNUM*2)) \
                            | (GPIO_MODER_ALT << (BOARD_RFSPI_MISOPINNUM*2)) \
                            | (GPIO_MODER_ALT << (BOARD_RFSPI_MOSIPINNUM*2));
    
  //BOARD_RFSPI_PORT->MODER ^= (3 << (BOARD_RFSPI_SCLKPINNUM*2)) \
                            | (2 << (BOARD_RFSPI_MISOPINNUM*2)) \
                            | (3 << (BOARD_RFSPI_MOSIPINNUM*2));
#endif
}

static inline void BOARD_RFSPI_CLKOFF(void) {
#ifdef __USE_RADIO
    BOARD_RFSPI_PORT->MODER &= ~((3 << (BOARD_RFSPI_SCLKPINNUM*2)) \
                            | (3 << (BOARD_RFSPI_MISOPINNUM*2)) \
                            | (3 << (BOARD_RFSPI_MOSIPINNUM*2)) );
    
    BOARD_RFSPI_PORT->MODER |= (GPIO_MODER_OUT << (BOARD_RFSPI_SCLKPINNUM*2)) \
                            | (GPIO_MODER_IN << (BOARD_RFSPI_MISOPINNUM*2)) \
                            | (GPIO_MODER_OUT << (BOARD_RFSPI_MOSIPINNUM*2));
    
  //BOARD_RFSPI_PORT->MODER ^= (3 << (BOARD_RFSPI_SCLKPINNUM*2)) \
                            | (2 << (BOARD_RFSPI_MISOPINNUM*2)) \
                            | (3 << (BOARD_RFSPI_MOSIPINNUM*2));
#endif
}



#include <platform/timers.h>    // for systim_stop_clocker()
static inline void BOARD_STOP(ot_int code) {
/// code comes from sys_sig_powerdown, but it is usually 0-3.
/// For all STM32L devices, 3 is full-idle and 2 is radio-active-idle.  
/// Those are the only modes that should call this inline function.

    static const ot_u16 stop_flags[2] = {  
        (PWR_CR_LPSDSR | PWR_CR_CSBF), (PWR_CR_LPSDSR | PWR_CR_FWU | PWR_CR_ULP | PWR_CR_CSBF) };
        
    static const ot_u32 rcc_flags[2] = {
        (RCC_IOPENR_GPIOAEN | RCC_IOPENR_GPIOBEN), 0 };
        
    static const ot_u32 b_moder[2] = {
        0xFFFFFC0, 0xFFFFFFFF };
    
    ot_u16 scratch;
    
    code &= 1;
    
#   if defined(__RELEASE__)
      //GPIOA->MODER    = 0xFFFFFFFF;
      //GPIOB->MODER    = b_moder[code];
      //GPIOA->PUPDR    = 0;
      //GPIOB->PUPDR    = 0;      //can be ignored, always 0
      RCC->IOPENR    &= rcc_flags[code];
#   endif

    SysTick->CTRL = 0;
    SCB->SCR   |= SCB_SCR_SLEEPDEEP_Msk;
    scratch     = PWR->CR;
    scratch    &= ~(PWR_CR_DBP | PWR_CR_PDDS | PWR_CR_LPSDSR);
    scratch    |= stop_flags[code];
    PWR->CR     = scratch;
    
    EXTI->PR    = 0;
    systim_stop_clocker();
    platform_enable_interrupts();
    
    __WFI();
    
    // On Wakeup (from STOP) clear flags & re-enable backup register area
    PWR->CR |= (PWR_CR_DBP | PWR_CR_CWUF | PWR_CR_CSBF);
    
    // On wakeup, immediately reset SLEEPDEEP bit
    SCB->SCR &= ~((ot_u32)SCB_SCR_SLEEPDEEP_Msk);
    
    // Re-enable ports
#   if defined(__RELEASE__)
      RCC->IOPENR    |= _IOPENR_RUNTIME;
      //GPIOA->PUPDR    = GPIOA_PUPDR_DEFAULT;
      //GPIOB->PUPDR    = GPIOB_PUPDR_DEFAULT;    //can be ignored, always 0
      //GPIOA->MODER    = GPIOA_MODER_DEFAULT;
      //GPIOB->MODER    = GPIOB_MODER_DEFAULT;
#   endif
}




static inline void BOARD_PORT_STANDBY() {
///@todo implement this!
}




///@note BOARD Macro for initializing the STM32 PVD Module (voltage monitor) at
///      startup.  Only relevant for battery-powered boards.
static inline void BOARD_POWER_STARTUP(void) {
#   if (MCU_FEATURE_SVMONITOR == ENABLED)
    // Level0 is 1.9V, each level is +0.2V.  Check your battery spec and change
    // the _LEVx component to match it.  Typical Li-Ion undervoltage is 2.7V.
    PWR->CR    |= PWR_CR_PLS_LEV0 | PWR_CR_PVDE;  
#   endif
}



///@note BOARD Macro for initializing the STM32 Crystal startup routine, done
///      at startup.  It must startup ALL the crystals that you want to run 
///      during normal operation.
static inline void BOARD_XTAL_STARTUP(void) {
}



///@note BOARD Macros for turning-on and turning-off the High-speed XTAL.
///      High speed XTAL does not exist on this board, so it is empty.
static inline void BOARD_HSXTAL_ON(void) {
}
static inline void BOARD_HSXTAL_OFF(void) {
}



///@brief BOARD Macros for turning-on and turning-off the USB Clock, which may
///       be implemented in a lot of different ways depending on the board, the
///       MCU, and the configuration.
///
///@note  For STM32L0, the standard implementation is to use the CRS system in
///       combination with the PLL.
///

static inline void BOARD_USBCLK_ON(void) {
#if BOARD_FEATURE(USBPLL)
    RCC->APB1ENR |= RCC_APB1ENR_USBEN;
    platform_ext_pllon();
#else
    platform_ext_usbcrson();
#endif
}

